
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.access_request_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.access_request_key must be replaced
-/+ resource "azurerm_key_vault_secret" "access_request_key" {
      ~ id                      = "https://lau-aat.vault.azure.net/secrets/access-backend-encryption-key/d75f9d9401ea459ea0bac35f1de48ca1" -> (known after apply)
      ~ name                    = "access-backend-encryption-key" -> "case-backend-encryption-key" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat/secrets/access-backend-encryption-key/versions/d75f9d9401ea459ea0bac35f1de48ca1" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-aat/providers/Microsoft.KeyVault/vaults/lau-aat/secrets/access-backend-encryption-key" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "d75f9d9401ea459ea0bac35f1de48ca1" -> (known after apply)
      ~ versionless_id          = "https://lau-aat.vault.azure.net/secrets/access-backend-encryption-key" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":767,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->